GetHairdresser.Client/c2a8945a-c64c-4258-9b21-aaa9ad3b63e5Web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-04-23T12:27:09.1117277Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{c6c3f26e-b7b0-4b3b-89c5-e41359c82847}" /><Execution ProcessName="iisexpress" ProcessID="1176" ThreadID="15" /><Channel/><Computer>EN30231</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-04-23T15:27:08.9637856+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IUserService/GetAllHairdress</Action><To>http://localhost/GetHairDresser.Service/UserService.svc</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo2WT0MyXKhhPpCK8QAMOdZQAAAAAZMadtVtSrUaYGsQdrUqSW66DUtlqBKFDjkAiq84XwQAACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="882ffb3a-7c23-4e7b-875b-0948f21803ca" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">c6c3f26e-b7b0-4b3b-89c5-e41359c82847</ActivityId></s:Header><s:Body><GetAllHairdress xmlns="http://tempuri.org/"></GetAllHairdress></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-04-23T12:27:40.4234424Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{c6c3f26e-b7b0-4b3b-89c5-e41359c82847}" /><Execution ProcessName="iisexpress" ProcessID="1176" ThreadID="15" /><Channel/><Computer>EN30231</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-04-23T15:27:40.4224416+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>3025</Content-Length><Cache-Control>private</Cache-Control><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Wed, 23 Apr 2014 12:27:40 GMT</Date><Server>Microsoft-IIS/8.5</Server><X-AspNet-Version>4.0.30319</X-AspNet-Version><X-Powered-By>ASP.NET</X-Powered-By></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="78d58430-7b93-495b-baec-54885b564be1" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">c6c3f26e-b7b0-4b3b-89c5-e41359c82847</ActivityId></s:Header><s:Body><GetAllHairdressResponse xmlns="http://tempuri.org/"><GetAllHairdressResult xmlns:a="http://schemas.datacontract.org/2004/07/GetHairDresser.Common" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:User><a:JobAppointments></a:JobAppointments><a:UserFacebook i:nil="true"></a:UserFacebook><a:UserGuid>620961d7-2a0f-4dbc-9ee2-f1449be3da4f</a:UserGuid><a:UserId>1</a:UserId><a:age>16</a:age><a:email>asdasd</a:email><a:firstName>garaj</a:firstName><a:gender>sadas</a:gender><a:hairdressInfo xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"><b:HairdressID i:nil="true"></b:HairdressID><b:HairdressInfoID>1</b:HairdressInfoID><b:map_data i:nil="true"></b:map_data><b:photo>asd</b:photo><b:rating>6.5</b:rating></a:hairdressInfo><a:lastName>vadim</a:lastName><a:location>asd</a:location><a:receivedListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:receivedListMessages><a:sendListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:sendListMessages><a:typeClient>hairdress</a:typeClient></a:User><a:User><a:JobAppointments></a:JobAppointments><a:UserFacebook>231312</a:UserFacebook><a:UserGuid>620961d7-2a0f-4dbc-9ee2-f1449be3da4f</a:UserGuid><a:UserId>2</a:UserId><a:age>16</a:age><a:email>asdasd</a:email><a:firstName>iura</a:firstName><a:gender>sadas</a:gender><a:hairdressInfo xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"><b:HairdressID i:nil="true"></b:HairdressID><b:HairdressInfoID>2</b:HairdressInfoID><b:map_data i:nil="true"></b:map_data><b:photo>asd</b:photo><b:rating>6.5</b:rating></a:hairdressInfo><a:lastName>vasea</a:lastName><a:location>asd</a:location><a:receivedListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:receivedListMessages><a:sendListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:sendListMessages><a:typeClient>hairdress</a:typeClient></a:User><a:User><a:JobAppointments></a:JobAppointments><a:UserFacebook>100002629863992</a:UserFacebook><a:UserGuid>e965e20c-e106-4347-92f6-da9bbdbbb651</a:UserGuid><a:UserId>3</a:UserId><a:age>30</a:age><a:email i:nil="true"></a:email><a:firstName>Iura</a:firstName><a:gender i:nil="true"></a:gender><a:hairdressInfo xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"><b:HairdressID i:nil="true"></b:HairdressID><b:HairdressInfoID>3</b:HairdressInfoID><b:map_data i:nil="true"></b:map_data><b:photo i:nil="true"></b:photo><b:rating>0</b:rating></a:hairdressInfo><a:lastName>Gaitur</a:lastName><a:location>Ungheni, Ungheni, Moldova</a:location><a:receivedListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:receivedListMessages><a:sendListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:sendListMessages><a:typeClient>hairdress</a:typeClient></a:User></GetAllHairdressResult></GetAllHairdressResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-04-23T12:27:40.4434407Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{1cc40e32-8494-4d22-b817-df5933248baf}" /><Execution ProcessName="iisexpress" ProcessID="1176" ThreadID="15" /><Channel/><Computer>EN30231</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-04-23T15:27:40.4434407+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IUserService/Register</Action><To>http://localhost/GetHairDresser.Service/UserService.svc</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo2eT0MyXKhhPpCK8QAMOdZQAAAAAZMadtVtSrUaYGsQdrUqSW66DUtlqBKFDjkAiq84XwQAACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="bad076b9-52f9-46fa-9240-508c61717356" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">1cc40e32-8494-4d22-b817-df5933248baf</ActivityId></s:Header><s:Body><Register xmlns="http://tempuri.org/"><u xmlns:a="http://schemas.datacontract.org/2004/07/GetHairDresser.Common" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:JobAppointments></a:JobAppointments><a:UserFacebook>231312</a:UserFacebook><a:UserGuid>620961d7-2a0f-4dbc-9ee2-f1449be3da4f</a:UserGuid><a:UserId>0</a:UserId><a:age>16</a:age><a:email>asdasd</a:email><a:firstName>iura</a:firstName><a:gender>sadas</a:gender><a:hairdressInfo xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"><b:HairdressID i:nil="true"></b:HairdressID><b:HairdressInfoID>0</b:HairdressInfoID><b:map_data i:nil="true"></b:map_data><b:photo>asd</b:photo><b:rating>6.5</b:rating></a:hairdressInfo><a:lastName>vasea</a:lastName><a:location>asd</a:location><a:receivedListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:receivedListMessages><a:sendListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:sendListMessages><a:typeClient>hairdress</a:typeClient></u></Register></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-04-23T12:27:40.8076470Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{1cc40e32-8494-4d22-b817-df5933248baf}" /><Execution ProcessName="iisexpress" ProcessID="1176" ThreadID="15" /><Channel/><Computer>EN30231</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-04-23T15:27:40.8076470+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>402</Content-Length><Cache-Control>private</Cache-Control><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Wed, 23 Apr 2014 12:27:40 GMT</Date><Server>Microsoft-IIS/8.5</Server><X-AspNet-Version>4.0.30319</X-AspNet-Version><X-Powered-By>ASP.NET</X-Powered-By></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="81ef5c64-4753-4fc1-9894-7014ebc83634" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">1cc40e32-8494-4d22-b817-df5933248baf</ActivityId></s:Header><s:Body><RegisterResponse xmlns="http://tempuri.org/"><RegisterResult>false</RegisterResult></RegisterResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-04-23T12:27:40.9276392Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{5cef6631-d492-41a8-bb2f-c828b857d712}" /><Execution ProcessName="iisexpress" ProcessID="1176" ThreadID="15" /><Channel/><Computer>EN30231</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-04-23T15:27:40.9266391+03:00" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IUserService/Register</Action><To>http://localhost/GetHairDresser.Service/UserService.svc</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo2iT0MyXKhhPpCK8QAMOdZQAAAAAZMadtVtSrUaYGsQdrUqSW66DUtlqBKFDjkAiq84XwQAACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="3ab38525-d626-42e0-adeb-3a2e21aa68c3" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">5cef6631-d492-41a8-bb2f-c828b857d712</ActivityId></s:Header><s:Body><Register xmlns="http://tempuri.org/"><u xmlns:a="http://schemas.datacontract.org/2004/07/GetHairDresser.Common" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:JobAppointments></a:JobAppointments><a:UserFacebook>231312</a:UserFacebook><a:UserGuid>620961d7-2a0f-4dbc-9ee2-f1449be3da4f</a:UserGuid><a:UserId>0</a:UserId><a:age>16</a:age><a:email>asdasd</a:email><a:firstName>iura</a:firstName><a:gender>sadas</a:gender><a:hairdressInfo xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"><b:HairdressID i:nil="true"></b:HairdressID><b:HairdressInfoID>0</b:HairdressInfoID><b:map_data i:nil="true"></b:map_data><b:photo>asd</b:photo><b:rating>6.5</b:rating></a:hairdressInfo><a:lastName>vasea</a:lastName><a:location>asd</a:location><a:receivedListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:receivedListMessages><a:sendListMessages xmlns:b="http://schemas.datacontract.org/2004/07/GetHairDresser.Common.Entities"></a:sendListMessages><a:typeClient>hairdress</a:typeClient></u></Register></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2014-04-23T12:27:40.9886356Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{5cef6631-d492-41a8-bb2f-c828b857d712}" /><Execution ProcessName="iisexpress" ProcessID="1176" ThreadID="15" /><Channel/><Computer>EN30231</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2014-04-23T15:27:40.9876355+03:00" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>402</Content-Length><Cache-Control>private</Cache-Control><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Wed, 23 Apr 2014 12:27:40 GMT</Date><Server>Microsoft-IIS/8.5</Server><X-AspNet-Version>4.0.30319</X-AspNet-Version><X-Powered-By>ASP.NET</X-Powered-By></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="887c499a-3136-444b-98a7-809505976814" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">5cef6631-d492-41a8-bb2f-c828b857d712</ActivityId></s:Header><s:Body><RegisterResponse xmlns="http://tempuri.org/"><RegisterResult>false</RegisterResult></RegisterResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent>